<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"e20e20aab417f94f8e0d89f186b1f71d782ec55013686bd5fe115df720551a1b","plan_job_ref":"Job Create terraform plan for Palo Alto Panorama Add-on #18 at https://github.com/AFMPE/mpe_palo_alto/actions/runs/7640066035","plan_hash":"54c1405cd1fce4d71f7287844fa6adb9411853e4d5c3082aff817511935c003c","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh9df3erta
container_name=paloalto            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
jumpbox_vm_admin_ssh_private_key  = (sensitive value)
jumpbox_vm_admin_ssh_public_key   = (sensitive value)
panorama_vm_admin_ssh_private_key = (sensitive value)
panorama_vm_admin_ssh_public_key  = (sensitive value)
production_subscription_id        = (sensitive value)
spoke_subscription_id             = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_secret.panorama-jumpbox-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-jumpbox-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "PanoramaJumpbox-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.panorama-server-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-server-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "Panorama-Server-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_virtual_machine_extension.omsagentlinux[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentlinux" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForLinux"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "OmsAgentForLinux"
      + type_handler_version        = "1.13"
      + virtual_machine_id          = "********************************************************************************************************************************************************************"
    }

  # module.mod_panorama_virtual_machine.azurerm_linux_virtual_machine.linux_vm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linux_vm" {
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-panorama-prod-vm"
      + network_interface_ids                                  = [
          + "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-prod-nic",
          + "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-prod-sec-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D16ls_v5"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-panorama-prod-vm"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + plan {
          + name      = "byol"
          + product   = "panorama"
          + publisher = "paloaltonetworks"
        }

      + source_image_reference {
          + offer     = "panorama"
          + publisher = "paloaltonetworks"
          + sku       = "byol"
          + version   = "10.1.10"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "enable_resource_locks" but
a value was found in file "tfvars/parameters.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"jumpbox_windows_distribution_name" but a value was found in file
"tfvars/parameters.tfvars". If you meant to use this value, add a "variable"
block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [Create terraform plan for Palo Alto Panorama Add-on #18](https://github.com/AFMPE/mpe_palo_alto/actions/runs/7640066035)